In [39]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [40]:
%%sql

# show databases;

# create database Patterns;
use Patterns;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [4]:
%%sql

DROP TABLE IF EXISTS demo_events;
CREATE TABLE demo_events (
    event_id INT AUTO_INCREMENT PRIMARY KEY,
    event_name VARCHAR(100),
    event_date DATETIME,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql

INSERT INTO demo_events (event_name, event_date)
VALUES
    ('New Year Celebration', '2025-01-01 00:00:00'),
    ('Summer Fest', '2025-06-15 12:30:00');

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[]

In [6]:
%%sql

SELECT 
    event_id,
    event_name,
    event_date, 
    created_at 
FROM demo_events;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'New Year Celebration', datetime.datetime(2025, 1, 1, 0, 0), datetime.datetime(2025, 9, 6, 22, 8, 30)),
 (2, 'Summer Fest', datetime.datetime(2025, 6, 15, 12, 30), datetime.datetime(2025, 9, 6, 22, 8, 30))]

In [11]:
%%sql

select time(event_date) as EventTime, 
date(event_date) as EventDate, 
day(event_date) as EventDay, 
week(event_date) as EventWeek, 
month(event_date) as EventMonth, 
year(event_date) as EventYear 
from demo_events;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(datetime.timedelta(0), datetime.date(2025, 1, 1), 1, 0, 1, 2025),
 (datetime.timedelta(seconds=45000), datetime.date(2025, 6, 15), 15, 24, 6, 2025)]

In [20]:
%%sql

select 
event_date - INTERVAL 20 DAY as PreEvent,
event_date as EventDay,
event_date + INTERVAL 20 DAY as PostEvent
from demo_events;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(datetime.datetime(2024, 12, 12, 0, 0), datetime.datetime(2025, 1, 1, 0, 0), datetime.datetime(2025, 1, 21, 0, 0)),
 (datetime.datetime(2025, 5, 26, 12, 30), datetime.datetime(2025, 6, 15, 12, 30), datetime.datetime(2025, 7, 5, 12, 30))]

In [23]:
%%sql

select 
event_date as EventDay,
DATE_FORMAT(event_date, '%W, %M %e %Y') as ProperEventDay,
DATE_FORMAT(event_date, '%h:%i %p') as ProperEventTime
from demo_events;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(datetime.datetime(2025, 1, 1, 0, 0), 'Wednesday, January 1 2025', '12:00 AM'),
 (datetime.datetime(2025, 6, 15, 12, 30), 'Sunday, June 15 2025', '12:30 PM')]

In [25]:
%%sql

# -- 7. (Optional) Demonstrate ON UPDATE CURRENT_TIMESTAMP

ALTER TABLE demo_events 
    MODIFY COLUMN created_at TIMESTAMP 
        DEFAULT CURRENT_TIMESTAMP 
        ON UPDATE CURRENT_TIMESTAMP;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [26]:
%%sql

-- Update a row to see created_at change
UPDATE demo_events 
SET event_name = 'Summer Fest - Updated' 
WHERE event_id = 2;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [27]:
%%sql

SELECT 
    event_id,
    event_name,
    event_date, 
    created_at 
FROM demo_events;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'New Year Celebration', datetime.datetime(2025, 1, 1, 0, 0), datetime.datetime(2025, 9, 6, 22, 8, 30)),
 (2, 'Summer Fest - Updated', datetime.datetime(2025, 6, 15, 12, 30), datetime.datetime(2025, 9, 6, 22, 21, 21))]

In [30]:
# In SQL, "regex" stands for "regular expression," which is a sequence of characters used to define a search pattern, 
# allowing you to find and manipulate text data within your database by matching complex patterns within strings, 
# rather than just exact matches, essentially providing a powerful tool for searching, extracting, 
# and validating data based on specific character patterns within your SQL queries.

In [41]:
%%sql

DROP TABLE IF EXISTS regex_samples;

CREATE TABLE regex_samples (
    id INT AUTO_INCREMENT PRIMARY KEY,
    sample_text VARCHAR(100)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [42]:
%%sql

INSERT INTO regex_samples (sample_text) VALUES 
('apple'), 
('Banana'),  
('cherry'),
('date'),       
('elderberry'), 
('fig'),    
('grape'),      
('honeydew'),
('running'), 
('123abc');

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[]

In [43]:
%%sql

# Example 1: Match Strings That Start with “a”

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^a';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 'apple')]

In [45]:
%%sql

# Example 2: Match Strings That End with “e”

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP 'e$';

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'apple'), (4, 'date'), (7, 'grape')]

In [47]:
%%sql

# Example 3: Match Strings That Start with a Digit

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^[0-9]';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(10, '123abc')]

In [48]:
%%sql

# Example 4: Match Strings Ending with “ing”

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP 'ing$';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(9, 'running')]

In [50]:
%%sql

# Example 5: Match Strings with Consecutive Repeated Characters

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '(.)\\1';

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'apple'), (3, 'cherry'), (5, 'elderberry'), (9, 'running')]

In [51]:
%%sql

# Example 6: Match Strings That Contain Only Letters

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^[A-Za-z]+$';

 * mysql+mysqlconnector://root:***@localhost/
9 rows affected.

[(1, 'apple'),
 (2, 'Banana'),
 (3, 'cherry'),
 (4, 'date'),
 (5, 'elderberry'),
 (6, 'fig'),
 (7, 'grape'),
 (8, 'honeydew'),
 (9, 'running')]

In [52]:
%%sql

# Example 7: Match Strings with Exactly 5 Characters

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^.{5}$';

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [55]:
%%sql

# Example 8: Match Strings Containing an Uppercase Letter (Case‑Sensitive) -- this may not work in some versions

SELECT * 
FROM regex_samples
WHERE sample_text COLLATE utf8mb4_0900_as_cs REGEXP '[A-Z]';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(2, 'Banana')]

In [56]:
%%sql

# Example 9: Match Only “apple” or “banana” Exactly

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^(apple|banana)$';

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'apple'), (2, 'Banana')]

In [57]:
%%sql

# Example 10: Match Strings Starting with 3 Digits Followed by Letters

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^[0-9]{3}[A-Za-z]+$';

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [58]:
%%sql

CREATE TABLE demo_data (
    id INT AUTO_INCREMENT PRIMARY KEY,
    full_name VARCHAR(50),
    phone VARCHAR(25),
    email VARCHAR(100),
    date_col VARCHAR(10),   -- Storing as VARCHAR for the demo
    status VARCHAR(20),
    sku VARCHAR(20),
    username VARCHAR(30),
    notes VARCHAR(100)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [59]:
%%sql

INSERT INTO demo_data (full_name, phone, email, date_col, status, sku, username, notes)
VALUES
-- 1
('John Smith', 
 '123-456-7890', 
 'john@example.com', 
 '2025-02-07', 
 'pending', 
 'ABCD', 
 'johnsmith', 
 'Ships to CA'),

-- 2
('Alice Johnson', 
 '(987) 654-3210', 
 'alice@@example.net', 
 '2025-02-07', 
 'inactive', 
 'SKU-123', 
 'alice', 
 'NY location'),

-- 3
('Bob Williams', 
 '+1-555-123-4567', 
 'bob@sample.org', 
 '20250207', 
 'complete', 
 '1SKU', 
 'bob123', 
 'Shipping to CA'),

-- 4
('Mary 1 White', 
 '(123) 123-4567', 
 'mary123@example.com', 
 '2025-13-31', 
 'PENDING', 
 'abc-999', 
 'mary_white', 
 'Something about CA or'),

-- 5
('Mark-Spencer', 
 '1234567890', 
 'mark@example.com', 
 '2024-11-02', 
 'active', 
 'SKU-9999', 
 'mark', 
 'Random note'),

-- 6
('Jane O''Connor',   -- Note the doubled apostrophe for SQL
 '987-654-3210', 
 'jane.o.connor@example.org', 
 '2024-12-31', 
 'inactive', 
 'ABCDE', 
 'janeO', 
 'Contains CA or NY'),

-- 7
('Invalid Mail', 
 '000-000-0000', 
 'invalid@@example..com', 
 '2023-01-15', 
 'inactive', 
 'XYZ000', 
 'invalid', 
 'Double @ and dots'),

-- 8
('NoSpacesHere', 
 '+12-345-678-9012',
 'nospaces@example.co',
 '2025-02-07',
 'pending',
 'SKU999',
 'NoSpaces',
 'Ends with .co domain');

 * mysql+mysqlconnector://root:***@localhost/
8 rows affected.

[]

In [63]:
%%sql

# 1. Matching a Strict Date Format (YYYY-MM-DD)

SELECT *
FROM demo_data
WHERE date_col REGEXP '^[0-9]{4}-[0-9]{2}-[0-9]{2}$';

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [64]:
%%sql

# 2. Matching Names Containing Only Letters and Spaces

SELECT *
FROM demo_data
WHERE full_name REGEXP '^[A-Za-z ]+$';

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'John Smith', '123-456-7890', 'john@example.com', '2025-02-07', 'pending', 'ABCD', 'johnsmith', 'Ships to CA'),
 (2, 'Alice Johnson', '(987) 654-3210', 'alice@@example.net', '2025-02-07', 'inactive', 'SKU-123', 'alice', 'NY location'),
 (3, 'Bob Williams', '+1-555-123-4567', 'bob@sample.org', '20250207', 'complete', '1SKU', 'bob123', 'Shipping to CA'),
 (7, 'Invalid Mail', '000-000-0000', 'invalid@@example..com', '2023-01-15', 'inactive', 'XYZ000', 'invalid', 'Double @ and dots'),
 (8, 'NoSpacesHere', '+12-345-678-9012', 'nospaces@example.co', '2025-02-07', 'pending', 'SKU999', 'NoSpaces', 'Ends with .co domain')]